#include"contact.h"
void menu()
{
    printf("***************************************************************************\n");
    printf("***************************       通讯录     ******************************\n");
    printf("***************************    1.添加好友    ******************************\n");
    printf("***************************    2.删除好友    ******************************\n");
    printf("***************************    3.修改信息    ******************************\n");
    printf("***************************    4.删除信息    ******************************\n");
    printf("***************************    5.查看全部    ******************************\n");
    printf("***************************    6.查询信息    ******************************\n");
    printf("***************************    7.退出程序    ******************************\n");
    printf("***************************************************************************\n");
}
int main()
{
    F f[MAX]={0};
    int size=0;
    int input;
    do
    {
        menu();
        scanf("%d",&input);
        switch(input)
{
    case 1:
        add(f,size);
        size++;
        break;
    case 2:
        dell(f,size);
        size--;
        break;
    case 3:
        change(f,size);
        break;
    case 4:
        del(f,size);
        break;
    case 5:
        print(f,size);
        break;
    case 6:
        search(f,size);
        break;
    case 7:
        printf("退出通讯录\n");
        break;
    default:
        printf("非法输入\n");
}
    }while(input);
    return 0;
}
